import React from 'react';

const Page: React.FC = () => {
  return (
    <div>
      <h1>Политика конфиденциальности</h1>

      <section>
        <h2>1. Какую информацию мы собираем?</h2>
        <p>
          Мы собираем следующие категории информации от посетителей нашего сайта:
        </p>
        <ul>
          <li>1.1 Информация, предоставляемая при подписке на рассылку: электронные адреса.</li>
          <li>1.2 Информация, предоставляемая при обращении по телефону: номера телефонов.</li>
          <li>1.3 Информация, предоставляемая через форму обратной связи: электронные адреса и номера телефонов.</li>
        </ul>
      </section>

      <section>
        <h2>2. Как мы собираем информацию?</h2>
        <p>
          Мы собираем информацию от посетителей сайта при заполнении форм нашего веб-сайта, при обращении по телефону и при подписке на нашу рассылку.
        </p>
      </section>

      <section>
        <h2>3. Как мы храним, используем, раскрываем и передаем персональные данные посетителей сайта?</h2>
        <p>
          Мы обрабатываем и храним ваши персональные данные с соблюдением всех необходимых юридических требований. Ваши данные используются только в целях предоставления вам запрашиваемых услуг и не раскрываются третьим лицам без вашего согласия, за исключением случаев, предусмотренных законом.
        </p>
      </section>

      <section>
        <h2>4. Как мы общаемся с посетителями сайта?</h2>
        <p>
          Мы можем использовать предоставленные вами контактные данные для обратной связи, отправки информационных материалов или уведомлений о новых услугах.
        </p>
      </section>

      <section>
        <h2>5. Как мы используем файлы cookie и другие инструменты отслеживания?</h2>
        <p>
          Мы можем использовать файлы cookie и другие технологии отслеживания для анализа использования сайта и предоставления персонализированного контента. Посетители сайта могут отключить файлы cookie в настройках своего браузера.
        </p>
      </section>

      <section>
        <h2>6. Как посетители сайта могут отозвать свое согласие?</h2>
        <p>
          Посетители могут отозвать свое согласие, связавшись с нами по указанным контактам. Однако, отзыв согласия может повлиять на их возможность использования определенных функций нашего сайта.
        </p>
      </section>

      <section>
        <h2>7. Обновления политики конфиденциальности</h2>
        <p>
          Мы оставляем за собой право вносить изменения в нашу политику конфиденциальности. Последняя версия всегда доступна на нашем веб-сайте.
        </p>
      </section>

      <footer>
        <p>
          Если у вас есть вопросы или предложения относительно нашей политики конфиденциальности, пожалуйста, свяжитесь с нами.
        </p>
      </footer>
    </div>
  );
};

export default Page;
